---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ExportFailures.IFCGenericExportWarning
source: html/24aa69cd-5d79-17e5-b791-e6bc449802f6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ExportFailures.IFCGenericExportWarning Property

Unexpected errors occurred while exporting these elements to the IFC file.

## Syntax (C#)
```csharp
public static FailureDefinitionId IFCGenericExportWarning { get; }
```